tutorials/incompressible/simpleSolver/ras/ACCM_convexCurvature2D/0/k
/*---------------------------------------------------------------------------*\
Caelus 10.04
Web:      www.caelus-cml.com 
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0.001052132;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.001052132;
    }
    left
    {
        type            empty;
    }
    outlet
    {
        type            zeroGradient;
    }
    right
    {
        type            empty;
    }
    top
    {
        type            fixedValue;
        value           uniform 1e-10;
    }
    wall
    {
        type            fixedValue;
        value           uniform 1e-10;
    }
}


// ************************************************************************* //
