tutorials/incompressible/simpleSolver/ras/ACCM_convexCurvature2D/system/decomposeParDict
/*-------------------------------------------------------------------------------*
Caelus 10.04
Web:   www.caelus-cml.com
\*------------------------------------------------------------------------------*/

FoamFile
{
    version     		2.0;
    format      		ascii;
    class       		dictionary;
    object      		decomposeParDict;
}
//--------------------------------------------------------------------------------

numberOfSubdomains 		4;// It is suggested that the numberOfSubdomains be increased based on available resources for validation cases and to reduce the computation time.


method          		scotch;

distributed     		no;

roots
(
);
